1907. Count Salary Categories

In [4]:
import pandas as pd

In [5]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

In [3]:
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [8]:
low_salary = accounts[accounts['income'] < 20000].shape[0]
average_salary = accounts[accounts['income'].between(20000, 50000)].shape[0]
high_salary = accounts[accounts['income'] > 50000].shape[0]

In [12]:
result = pd.DataFrame({
    'salary_category': ['Low Salary', 'average_salary,', 'High Salary'],
    'account_no': [low_salary, average_salary, high_salary]
})

In [13]:
result

   salary_category  account_no
0       Low Salary           1
1  average_salary,           0
2      High Salary           3